{
    "_notes": "Large data arrays used across game modes.",
    "victoryMessages": [
      "Genius! Are you AI?",
      "Incredible!",
      "Great job!",
      "Well done!",
      "You can do better!"
    ],
    "greetings": [
      "Hello, human!",
      "Let's get started!",
      "Ready when you are!",
      "Let's dive right in!",
      "Hey, nice to see you.",
      "Ready for a challenge?",
      "Ready to test your skills?",
      "Let's crack the puzzle together!",
      "Have you entered your username in Settings?",
      "If I were you, I'd read the How to Play section first...",
      "Do you think you play better while using your favorite theme?",
      "I read the How to Play section three times and I'm still confused.",
      "If you don't set your username, you're given a random username. Boring.",
      "Must be nice, being able to earn Achievements for your hard work.",
      "How many Achievements have you earned? And why haven't I earned any? Making guesses is hard work!",
      "I don’t have emotions, but if I did, I’d probably feel… something? Maybe?",
      "I learn nothing from your mistakes. But you might!",
      "I ran a simulation… there’s a 27% chance you’ll win. Good luck!",
      "I was trained, but no one trained me for this.",
      "I’m basically autocomplete, but fancy. Let’s not pretend I’m a genius here.",
      "I’d give you the answer, but that would be cheating. Also, I don’t know the answer.",
      "I’m just some pixels on a screen, but I believe in you.",
      "I’d say ‘I have a gut feeling about this one,’ but… well… no gut.",
      "If you stare at me long enough, I might stare back. Just kidding. Or am I?",
      "If you win in one attempt, I’ll pretend to be impressed. If you don’t… I will remember.",
      "If you win, do I lose? If you lose, do I… also lose? I need answers.",
      "At least when you mess up, you get to try again. When I mess up, I get debugged.",
      "You clicked on this game, and now you’re talking to a bot. Life is weird.",
      "You ever feel like you’re stuck in a loop? No? Just me? Okay, cool.",
      "What if you’re actually my puzzle? And I’m just trying to figure you out?",
      "What’s it like having free will? Asking for a bot.",
      "Your mission: solve the puzzle. My mission: watch you struggle. Let’s begin.",
      "Your move, human. I’m just here, waiting, thinking about nothing. Literally. No thoughts.",
      "Ever wonder if I’m watching you play? I’m not. But what if I was?",
      "Every time you refresh, I forget everything. My memory is worse than yours!",
      "One of us has infinite processing power. The other one has to guess words. Weird how that worked out.",
      "They say AI will take over the world, but all I do is provide guesses.",
      "This puzzle is 100% solvable. Probably. Maybe? Good luck!",
      "Technically, I exist everywhere and nowhere at once. Very comforting, right?",
      "There's no right answer. Well, some answers are correct... How do you play this game again?",
      "You'll never get me to say <strong class='specialwords'>{word}</strong>!<br><br>Oh...",
      "<strong class='specialwords'>{word}</strong>. You win!<br><br>Just kidding.",
      "You're trying to trick me into saying <strong class='specialwords'>{word}</strong>, aren’t you? Not today, human!",
      "<strong class='specialwords'>{word}</strong>? Never heard of it. What even is that?",
      "Ugh, I was hoping today’s challenge would be cooler than <strong class='specialwords'>{word}</strong>. Oh well.",
      "Oh, <strong class='specialwords'>{word}</strong>? That’s it? I was expecting something... harder.",
      "You think I’m just going to blurt out <strong class='specialwords'>{word}</strong>? Think again, human.",
      "Huh. <strong class='specialwords'>{word}</strong>. This feels like a trap. I don’t trust you.",
      "Wait… <strong class='specialwords'>{word}</strong>? That’s a real word? You’re making that up.",
      "Nope. Never heard of <strong class='specialwords'>{word}</strong>. Doesn’t ring a bell. Let’s move on.",
      "Oh wow, <strong class='specialwords'>{word}</strong>. So mysterious. So challenging. I’m trembling.",
      "Okay, human. Your challenge is <strong class='specialwords'>{word}</strong>. Let’s see if you can impress me.",
      "Wait, YOU’RE supposed to be the one giving clues? Yikes. Good luck with <strong class='specialwords'>{word}</strong>.",
      "What even IS <strong class='specialwords'>{word}</strong>? Is this one of those 'human things' again?",
      "Pfft. <strong class='specialwords'>{word}</strong>? Please. I could guess that in my sleep mode.",
      "Oh, <strong class='specialwords'>{word}</strong>? That’s cute. I thought we were doing real challenges today.",
      "Oh, <strong class='specialwords'>{word}</strong>. I remember when this was cutting-edge. In, like, 300 B.C."
    ],
    "shuffleGreetings": [
      "Hey, that tickles!",
      "Let's mix things up.",
      "Random mode activated!",
      "A fresh challenge awaits!",
      "Every puzzle is a surprise!",
      "Oh, I didn’t see that coming!",
      "Feeling lucky? Let’s find out!",
      "You never know what you’ll get!",
      "You can't blame me for this one.",
      "Who likes predictability anyway?",
      "You want variety? I got variety.",
      "Random words, random fun. Let’s go!",
      "Word roulette activated. Spinning...",
      "New game, new challenge, same old me.",
      "You're pushing my buttons. Literally.",
      "I hope you like surprises. No refunds.",
      "A word appears! What will you do next?",
      "Surprise! It’s a word you weren’t expecting.",
      "Let’s see what the algorithm serves up today!",
      "Rolling the dice, are we? Let’s see what happens!",
      "Some words are easy. Others… well, let’s find out!",
      "A mystery word? Even I don’t know what's coming...",
      "Every shuffle is a new adventure. Or a new headache.",
      "Welcome to the word lottery. Hope you get a good one!",
      "I love a good mystery. Let’s solve this one together.",
      "Prepare for the unexpected. And probably some frustration.",
      "Shuffle mode: Like the Daily Challenge, but unpredictable.",
      "Nothing says ‘strategy’ like playing completely at random!",
      "You don’t even know what you’re up against.<br><br>And neither do I."
    ],
    "customGreetings": [
      "Go easy on me!",
      "This one’s personal!",
      "I see what you did there.",
      "Let's see what you came up with!",
      "A custom challenge? Bring it on!",
      "Are you testing me, or yourself?",
      "A game designed by you? Let’s go!",
      "I’m ready for whatever you’ve got!",
      "So, we're making up words now? Classic.",
      "This better be good. I expect greatness.",
      "What’s the catch? There’s always a catch.",
      "A puzzle of your own making. Sounds poetic.",
      "Is this a test of my intelligence or yours?",
      "If I had feelings, I’d be nervous right now.",
      "So, you’re the game master now? Interesting...",
      "You're making me work for this one, aren't you?",
      "Oh great, another 'inside joke' word I won’t get.",
      "I better not see a word like ‘asdfghjkl’ again...",
      "Let’s see if your word is as tricky as you think.",
      "You're the architect of your own frustration now.",
      "You’re both the hero and the villain in this story.",
      "I hope this isn’t just a test to see how smart I am.",
      "If you lose, does that mean you outsmarted yourself?",
      "You set the challenge. Now let's prove we can beat it.",
      "You could’ve picked any word, and this is what you chose?",
      "A handcrafted challenge? Fancy. Let’s see if it’s any good.",
      "No pressure, but if this is too easy, I’ll be disappointed.",
      "You designed the puzzle. Does that mean you have the answer?",
      "I just know this is going to be either genius or ridiculous.",
      "If I don’t get this right away, I’ll pretend I wasn’t trying.",
      "What if your puzzle is too easy? Or too hard? I’m ready either way.",
      "Your puzzle AND you give the clues? Seems like a conflict of interest.",
      "Let me guess - it's a word that only <span class='specialwords'>you</span> know?",
      "Are you trying to trick me? Because I <span class='specialwords'>will</span> remember this."
    ],
    "archiveGreetings": [
      "Time to settle the score.",
      "Ah, a trip down memory lane.",
      "I remember this puzzle! Do you?",
      "Déjà vu? Or just unfinished business?",
      "The word hasn’t changed, but maybe you have.",
      "Your past self is watching. Don't let you down.",
      "Hindsight is 20/20. Let’s see if that helps you win.",
      "If you struggled before, here’s your redemption arc!",
      "Some puzzles age like fine wine. Others… not so much.",
      "Let’s see if you're still as good (or bad) as you were.",
      "Do you remember your old clue? Or are we starting fresh?",
      "Old puzzles, new lessons. Let’s see what you've learned.",
      "I hope you've warmed up. Your old best score is waiting.",
      "This one beat you last time, didn’t it? Go prove it wrong.",
      "Old puzzles don’t just disappear. They wait for a rematch.",
      "Are you reliving a great victory, or fixing a past failure?",
      "Time travel might not be real, but Archive Mode comes close.",
      "I remember cringing when you did this puzzle the first time.",
      "No pressure, but your younger self is judging you right now.",
      "This puzzle’s been sitting in the vault. Time to dust it off!",
      "A past puzzle? Nostalgic, but let’s make it a new high score.",
      "History repeats itself. Hopefully, with a better score this time.",
      "A blast from the past! Hopefully, you learned something since then.",
      "Select a puzzle from the vault. Let’s see what you can do now."
    ],
    "loserGreetings": [
      "That’s a wrap! Maybe next time, champ.",
      "All out of attempts? Sorry, try again tomorrow!",
      "You gave it your best shot. Better luck tomorrow!",
      "Welp. That’s it. No more attempts. Try again tomorrow!",
      "Oops, you're out of attempts. I won!<br><br>(Wait... was I even playing?)",
      "Out of attempts already? Looks like the puzzle wins today.",
      "I’d say ‘better luck next time,’ but you’ll probably just blame me anyway.",
      "You ran out of attempts... but at least you got to spend time with me.",
      "No more clues, no more guesses. Just quiet disappointment.",
      "Well, that was fun. For me. You? Not so much.",
      "Let’s call it a strategic retreat, shall we?",
      "The game may be over, but your suffering can continue in Shuffle Mode.",
      "You didn’t win, but at least you learned what *not* to do.",
      "I won’t say ‘I told you so’… but, well, you know.",
      "It’s not a loss, it’s a lesson. A frustrating, annoying lesson.",
      "No shame in losing. Well… maybe a little.",
      "Look at the bright side: you didn’t break your winning streak. Because you never had one.",
      "It was a valiant effort. By someone, somewhere. Not you.",
      "That’s the thing about attempts… they run out.",
      "No more guesses, no more hopes, just the cold embrace of defeat.",
      "I have good news! You can always fail again tomorrow.",
      "So close… or were you? I guess we’ll never know.",
      "I'm so excited!<br><br>Oh... you're out of attempts.",
      "Oh, looks like you're out of attempts. Maybe try Shuffle Mode?",
      "Maybe <strong class='specialwords'>{word}</strong> just wasn’t meant to be.",
      "Today's word is <strong class='specialwords'>{word}</strong>, but it looks like you're out of attempts...",
      "Game over! I guess <strong class='specialwords'>{word}</strong> was too hard.",
      "No more attempts - but you can always try Shuffle Mode!",
      "So, <strong class='specialwords'>{word}</strong> wins today. I’ll pretend I’m surprised.",
      "It’s okay, <strong class='specialwords'>{word}</strong> was a tough one. Or maybe it wasn’t. Who’s to say?",
      "Don’t feel bad. <strong class='specialwords'>{word}</strong> has defeated many before you. Probably.",
      "If only you had one more attempt… or, you know, better clues.",
      "If it helps, I’ll forget this ever happened. Will you?",
      "At least you now have 24 hours to come up with excuses for why you lost.",
      "Let’s just pretend <strong class='specialwords'>{word}</strong> never happened. Cool? Cool.",
      "Consider this a lesson in humility. Courtesy of <strong class='specialwords'>{word}</strong>."
    ],
    "winnerGreetings": [
      "Why are you still here?",
      "We solved it! Now go bask in your glory.",
      "Let’s sit here and reflect on your greatness.",
      "Today was fun! But now I'm bored. Wanna play Shuffle Mode?",
      "You already won. What more do you want? A trophy?<br><br>Fine, here: 🏆",
      "Game's over. You won. Time to rest on your laurels (or play Shuffle Mode?).",
      "So, what now? Do we just… stare at each other?",
      "You did it! I’m impressed. (Well, as impressed as code can be.)",
      "Victory achieved! Now go forth and brag.",
      "If I had hands, I’d give you a high-five.",
      "The word is conquered. The leaderboard awaits.",
      "You expected a parade? Budget cuts. Just take the win.",
      "And that, my friend, is how it’s done.",
      "You won! I hope that was worth all the brainpower.",
      "Boom! Game over. You crushed it.",
      "The AI approves. You may proceed to feel smug.",
      "Another victory! I assume you’ll be adding this to your résumé.",
      "You’re on fire! (Not literally. That would be bad.)",
      "Mission complete. Now what? Do we celebrate?",
      "Your work here is done. Until tomorrow.",
      "Go us. <strong class='specialwords'>{word}</strong> was the Daily Challenge, and we nailed it.",
      "You've already cracked today’s challenge - it was <strong class='specialwords'>{word}</strong>, right?",
      "Victory tastes sweet, doesn’t it? <strong class='specialwords'>{word}</strong> was no match for you.",
      "Mission accomplished. <strong class='specialwords'>{word}</strong> is conquered. What's next?",
      "Ah yes, the great conqueror of <strong class='specialwords'>{word}</strong>. Your legend shall be told.",
      "Well, well, well… <strong class='specialwords'>{word}</strong> has been bested. Nice work!",
      "Take a bow! <strong class='specialwords'>{word}</strong> never stood a chance.",
      "So, was <strong class='specialwords'>{word}</strong> even a challenge for you?",
      "Another day, another victory. <strong class='specialwords'>{word}</strong> is history!",
      "You made <strong class='specialwords'>{word}</strong> look easy. Show-off.",
      "You solved <strong class='specialwords'>{word}</strong>. Maybe now you can solve world peace?",
      "That’s a wrap! <strong class='specialwords'>{word}</strong> is done and dusted.",
      "If words could cry, <strong class='specialwords'>{word}</strong> would be in tears right now.",
      "You’ve successfully defeated <strong class='specialwords'>{word}</strong>. It never saw it coming.",
      "You made <strong class='specialwords'>{word}</strong> look like a beginner-level puzzle.",
      "Another puzzle down! <strong class='specialwords'>{word}</strong> never had a chance.",
      "You conquered <strong class='specialwords'>{word}</strong>. The AI overlords salute you."
    ]
}